[
  {
    "id": "x-1",
    "platform": "x",
    "content": "The feeling of winning is the ultimate orgasm for me. While competing, I realized there can only be one best, depending on people's perspectives. Real winning comes from feeling it - pure bliss, ultimate orgasm.",
    "link": "https://x.com/svarunid/status/1910331941464814033"
  },
  {
    "id": "x-2",
    "platform": "x",
    "content": "There are only two kinds of people: People who believe in tomorrow and those who don't. For me, there's no fuckin' tomorrow.",
    "link": "https://x.com/svarunid/status/1908519999070716257"
  },
  {
    "id": "x-3",
    "platform": "x",
    "content": "There are only two things that people need to do, to accomplish anything in life: Decide & Act.",
    "link": "https://x.com/svarunid/status/1906345676860215807"
  },
  {
    "id": "x-4",
    "platform": "x",
    "content": "Wasting time isn't always bad. Taking a break is a waste of time. But energy exhaustion is real. Stopping to replenish our energy is a good use of time.",
    "link": "https://x.com/svarunid/status/1902624757339783292"
  },
  {
    "id": "x-5",
    "platform": "x",
    "content": "When people face rejections they feel a want to know the reason. But, why aren't you curious about your acceptance/approvals? Strive to improve, so not only the bad never happens but good keeps happening.",
    "link": "https://x.com/svarunid/status/1857840663301427284"
  },
  {
    "id": "x-6",
    "platform": "x",
    "content": "Learning to market & sell ourselves and our work is essential for any professional to be sustainably successful.",
    "link": "https://x.com/svarunid/status/1838561756702216429"
  },
  {
    "id": "x-7",
    "platform": "x",
    "content": "The greatest and most valuable thing that I realized in my life is that, I can't change anything in this world and no one really can. Yet in order to bring the change you want, study and work to set the right circumstances and hope that things change.",
    "link": "https://x.com/svarunid/status/1824529177993007224"
  },
  {
    "id": "x-8",
    "platform": "x",
    "content": "Be sensitive to the chages happening around you, but don't be reactive. Reaction happens subconsciously leaving no space for you to think. Observing, thinking and questioning every event of change will teach you greater things.",
    "link": "https://x.com/svarunid/status/1819569476331008142"
  }
]
